src/AccumulationRegisters/Оборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Оборот</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВОсновнойВалюте</Name>
					<Comment>Сумма, пересчитанная в Константа.ОсновнаяВалюта — единственный ресурс, который можно суммировать по разным кошелькам/валютам.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта суммы (совпадает с Кошелек.Валюта). Дублируется здесь для удобства запросов.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвестиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инвестиции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ДостижениеЦелей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДостижениеЦелей</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНакопительно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ДоходностьПоИнвестициям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоходностьПоИнвестициям</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пополнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвестиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инвестиции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Календарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ПлановыеДвижения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПлановыеДвижения</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВОсновнойВалюте</Name>
					<Comment>Единственный ресурс, который можно суммировать по разным правилам/валютам — Сумма разных правил может быть в разных валютах.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Catalogs/Цели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Цели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДостижения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСИнфляцией</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелёк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ЛФПСервер/Ext/Module.bsl
// Возвращает пользователя, от имени которого сейчас ведётся личный финансовый план.
// Пока конфигурация однопользовательская, источник — константа ТекущийПользователь.
Функция ТекущийПользователь() Экспорт
	Возврат Константы.ТекущийПользователь.Получить();
КонецФункции

// Возвращает дату ближайшего прошедшего (или текущего) дня рождения на момент НаДату.
Функция ПоследнийДеньРождения(ДатаРождения, НаДату) Экспорт
	РезультатДата = Дата(Год(НаДату), Месяц(ДатаРождения), День(ДатаРождения));
	Если РезультатДата > НаДату Тогда
		РезультатДата = ДобавитьМесяц(РезультатДата, -12);
	КонецЕсли;
	Возврат РезультатДата;
КонецФункции

// Настраивает пунктирную линию серии диаграммы без маркеров — общий стиль плановых/справочных линий.
Процедура НастроитьПунктирнуюСерию(Серия, Цвет) Экспорт
	Серия.Линия	= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	Серия.Маркер	= ТипМаркераДиаграммы.Нет;
	Серия.Цвет		= Цвет;
КонецПроцедуры

Процедура ЗаполнитьДиаграммуЖизненныйПусть(Пользователь, Диаграмма) Экспорт

	Диаграмма.Очистить();

	Диаграмма.УстановитьПолныйИнтервал(Пользователь.ДатаРождения, Пользователь.ДатаДожития);

	ПоследнийДР = ПоследнийДеньРождения(Пользователь.ДатаРождения, ТекущаяДата());
	КолВоЛет = Год(ПоследнийДР) - Год(Пользователь.ДатаРождения);

	Точка	= Диаграмма.УстановитьТочку("_");
	Серия	= Диаграмма.УстановитьСерию("Пройденный жизненный путь");

	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
	Интервал = Значение.Добавить();
	Интервал.Начало	= Пользователь.ДатаРождения;
	Интервал.Конец		= ТекущаяДата();
	Интервал.Текст		= "Пройденный жизненный путь: " + Формат(КолВоЛет, "ЧДЦ=0");

	Серия = Диаграмма.УстановитьСерию("Период");

	ПоследнийДР = ПоследнийДеньРождения(Пользователь.ДатаРождения, Пользователь.ДатаНачалаАктивногоИнвестирования);
	КолВоЛетБезИнвестирования = Год(ПоследнийДР) - Год(Пользователь.ДатаРождения);

	ПоследнийДР = ПоследнийДеньРождения(Пользователь.ДатаРождения, Пользователь.ДатаПереходаНаПассивныйДоход);
	КолВоЛетИнвестирования = Год(ПоследнийДР) - Год(Пользователь.ДатаРождения) - КолВоЛетБезИнвестирования;

	ПоследнийДР = ПоследнийДеньРождения(Пользователь.ДатаРождения, Пользователь.ДатаДожития);
	КолВоЛетПассивногоДохода = Год(ПоследнийДР) - Год(Пользователь.ДатаРождения) - КолВоЛетБезИнвестирования - КолВоЛетИнвестирования;

	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
	Интервал = Значение.Добавить();
	Интервал.Начало		= Пользователь.ДатаРождения;
	Интервал.Конец			= Пользователь.ДатаНачалаАктивногоИнвестирования;
	Интервал.Текст			= "Период без инвестирования: " + Формат(КолВоЛетБезИнвестирования, "ЧДЦ=0");
	Интервал.Расшифровка	= Формат(Пользователь.ДатаРождения, "ДФ=dd.MM.yyyy") + " - " + Формат(Пользователь.ДатаНачалаАктивногоИнвестирования, "ДФ=dd.MM.yyyy");
	Интервал.Цвет			= WebЦвета.Красный;

	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
	Интервал = Значение.Добавить();
	Интервал.Начало		= Пользователь.ДатаНачалаАктивногоИнвестирования;
	Интервал.Конец			= Пользователь.ДатаПереходаНаПассивныйДоход;
	Интервал.Текст			= "Период активного инвестирования: " + Формат(КолВоЛетИнвестирования, "ЧДЦ=0");
	Интервал.Расшифровка	= Формат(Пользователь.ДатаНачалаАктивногоИнвестирования, "ДФ=dd.MM.yyyy") + " - " + Формат(Пользователь.ДатаПереходаНаПассивныйДоход, "ДФ=dd.MM.yyyy");
	Интервал.Цвет			= WebЦвета.Оранжевый;

	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
	Интервал = Значение.Добавить();
	Интервал.Начало		= Пользователь.ДатаПереходаНаПассивныйДоход;
	Интервал.Конец			= Пользователь.ДатаДожития;
	Интервал.Текст			= "Пассивный доход: " + Формат(КолВоЛетПассивногоДохода, "ЧДЦ=0");
	Интервал.Расшифровка	= Формат(Пользователь.ДатаПереходаНаПассивныйДоход, "ДФ=dd.MM.yyyy") + " - " + Формат(Пользователь.ДатаДожития, "ДФ=dd.MM.yyyy");
	Интервал.Цвет			= WebЦвета.ЗеленаяЛужайка;

КонецПроцедуры

Процедура ЗаполнитьДиаграммуЦели(Диаграмма) Экспорт

	Диаграмма.Очистить();

	СерияПлан = Диаграмма.Серии.Добавить("План");
	СерияФакт = Диаграмма.Серии.Добавить("Факт");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Цели.Ссылка КАК Цель,
	|	Цели.СуммаСИнфляцией КАК СуммаПлан
	|ПОМЕСТИТЬ втЦели
	|ИЗ
	|	Справочник.Цели КАК Цели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотОстатки.Цель КАК Цель,
	|	СУММА(ОборотОстатки.СуммаОстаток) КАК СуммаФакт
	|ПОМЕСТИТЬ втБаланс
	|ИЗ
	|	РегистрНакопления.Оборот.Остатки КАК ОборотОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотОстатки.Цель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЦели.Цель КАК Цель,
	|	втЦели.СуммаПлан КАК СуммаПлан,
	|	ЕСТЬNULL(втБаланс.СуммаФакт, 0) КАК СуммаФакт
	|ИЗ
	|	втЦели КАК втЦели
	|		ЛЕВОЕ СОЕДИНЕНИЕ втБаланс КАК втБаланс
	|		ПО втЦели.Цель = втБаланс.Цель
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммаПлан УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Точка = Диаграмма.УстановитьТочку(Выборка.Цель);
		Диаграмма.УстановитьЗначение(Точка, СерияФакт, Выборка.СуммаФакт, , Выборка.СуммаФакт);
		Диаграмма.УстановитьЗначение(Точка, СерияПлан, Выборка.СуммаПлан, , Выборка.СуммаПлан);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДиаграммуДостиженияЦелей(Диаграмма) Экспорт

	Диаграмма.Очистить();

	СерияЦель = Диаграмма.Серии.Добавить("Цель (сумма)");
	НастроитьПунктирнуюСерию(СерияЦель, WebЦвета.Оранжевый);

	СерияПлан = Диаграмма.Серии.Добавить("План (сумма)");
	НастроитьПунктирнуюСерию(СерияПлан, WebЦвета.Красный);

	СерияФакт = Диаграмма.Серии.Добавить("Факт (сумма)");
	НастроитьПунктирнуюСерию(СерияФакт, WebЦвета.Зеленый);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДостижениеЦелей.Период КАК Период,
		|	СУММА(ДостижениеЦелей.Сумма) КАК СуммаЦель,
		|	0 КАК СуммаПлан
		|ПОМЕСТИТЬ втЦели
		|ИЗ
		|	РегистрСведений.ДостижениеЦелей КАК ДостижениеЦелей
		|
		|СГРУППИРОВАТЬ ПО
		|	ДостижениеЦелей.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ДоходностьПоИнвестициям.Период, МЕСЯЦ),
		|	0,
		|	СУММА(ДоходностьПоИнвестициям.Пополнение + ДоходностьПоИнвестициям.Проценты)
		|ИЗ
		|	РегистрСведений.ДоходностьПоИнвестициям КАК ДоходностьПоИнвестициям
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ДоходностьПоИнвестициям.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ) КАК Период
		|ПОМЕСТИТЬ втКалендарь
		|ИЗ
		|	РегистрСведений.Календарь КАК Календарь
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЦели.Период КАК Период,
		|	СУММА(втЦели.СуммаЦель) КАК СуммаЦель,
		|	СУММА(втЦели.СуммаПлан) КАК СуммаПлан
		|ПОМЕСТИТЬ втЦели2
		|ИЗ
		|	втЦели КАК втЦели
		|
		|СГРУППИРОВАТЬ ПО
		|	втЦели.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОборотОстаткиИОбороты.Период КАК Период,
		|	ОборотОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ОборотОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	ОборотОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
		|	ОборотОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
		|	ОборотОстаткиИОбороты.СуммаРасход КАК СуммаРасход
		|ПОМЕСТИТЬ втФакт
		|ИЗ
		|	РегистрНакопления.Оборот.ОстаткиИОбороты(, , Месяц, , ) КАК ОборотОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКалендарь.Период КАК Период,
		|	ЕСТЬNULL(втЦели2.СуммаЦель, 0) КАК СуммаЦель,
		|	ЕСТЬNULL(втЦели2.СуммаПлан, 0) КАК СуммаПлан,
		|	ЕСТЬNULL(втФакт.СуммаОборот, 0) КАК СуммаФакт
		|ИЗ
		|	втКалендарь КАК втКалендарь
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЦели2 КАК втЦели2
		|		ПО втКалендарь.Период = втЦели2.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ втФакт КАК втФакт
		|		ПО втКалендарь.Период = втФакт.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаЦельНакопительно = 0;
	СуммаПланНакопительно = 0;
	СуммаФактНакопительно = 0;
	Пока Выборка.Следующий() Цикл
		СуммаЦельНакопительно = СуммаЦельНакопительно + Выборка.СуммаЦель;
		СуммаПланНакопительно = СуммаПланНакопительно + Выборка.СуммаПлан;
		СуммаФактНакопительно = СуммаФактНакопительно + Выборка.СуммаФакт;
		Точка = Диаграмма.УстановитьТочку(Формат(Выборка.Период, "ДФ=ММ.гггг"));
		Диаграмма.УстановитьЗначение(Точка, СерияЦель, СуммаЦельНакопительно, , СуммаЦельНакопительно);
		Диаграмма.УстановитьЗначение(Точка, СерияПлан, СуммаПланНакопительно, , СуммаПланНакопительно);
		Диаграмма.УстановитьЗначение(Точка, СерияФакт, СуммаФактНакопительно, , СуммаФактНакопительно);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДиаграммуДоходыРасходы(Диаграмма) Экспорт

	Диаграмма.Очистить();

	СерияРасход = Диаграмма.Серии.Добавить("Расходы (план)");
	НастроитьПунктирнуюСерию(СерияРасход, WebЦвета.Оранжевый);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ) КАК Период
		|ПОМЕСТИТЬ втКалендарь
		|ИЗ
		|	РегистрСведений.Календарь КАК Календарь
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ПлановыеДвижения.Период, МЕСЯЦ) КАК Период,
		|	СУММА(ПлановыеДвижения.Сумма) КАК Расход
		|ПОМЕСТИТЬ втРасходы
		|ИЗ
		|	РегистрНакопления.ПлановыеДвижения КАК ПлановыеДвижения
		|ГДЕ
		|	ПлановыеДвижения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ПлановыеДвижения.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКалендарь.Период КАК Период,
		|	ЕСТЬNULL(втРасходы.Расход, 0) КАК Расход
		|ИЗ
		|	втКалендарь КАК втКалендарь
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРасходы КАК втРасходы
		|		ПО втКалендарь.Период = втРасходы.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Точка = Диаграмма.УстановитьТочку(Формат(Выборка.Период, "ДФ=ММ.гггг"));
		Диаграмма.УстановитьЗначение(Точка, СерияРасход, Выборка.Расход, , Выборка.Расход);
	КонецЦикла;

КонецПроцедуры
